# SU4

## Import Data

In [1]:
import pandas as pd

In [2]:
# read fruits.csv

fruits_df = pd.read_csv("fruits.csv")

fruits_df #this is a pandas dataframe

   Fruits  Prices      Country
0   Apple     1.2       Africa
1  Orange     0.7       Russia
2  Banana     0.9  New Zealand

In [ ]:
fruits_df["Fruits"] # single column - returns as a Series Object instead of a DF

In [ ]:
fruits_df[ ["Fruits"] ] #returns as a dataframe

In [ ]:
fruits_df[ ["Fruits", "Prices"] ]

In [ ]:
fruits_2col_df = fruits_df[ ["Fruits", "Prices"] ] #multiple columns
fruits_2col_df

## using iloc

In [ ]:
fruits_df.iloc[ [0,2], :] #first and third rows, ‘ : ’ after the comma indicates all columns

In [ ]:
fruits_df.iloc[ [1], :] #row 1 only, double [] brackets to return as a dataframe

In [ ]:
fruits_df.iloc[ [0,2], 0:2] #first and third rows, first column, two columns

## using loc

In [35]:
fruits_df_indexed = fruits_df.set_index("Fruits", inplace=False)
fruits_df_indexed

        Prices      Country
Fruits
Apple      1.2       Africa
Orange     0.7       Russia
Banana     0.9  New Zealand

In [ ]:
fruits_df_indexed.loc[ ["Apple", "Orange"], :]

In [ ]:
#loc with row and col labels
fruits_df_indexed.loc[ ["Apple", "Orange"], ["Prices"] ]

## Using iloc and loc

In [36]:
fruits_df[ ["Country"] ]

       Country
0       Africa
1       Russia
2  New Zealand

In [ ]:
fruits_df[ ["Country"] ].iloc[ [0,2] ]

In [ ]:
#fruits_df.iloc[ [0,2], ["Country"] ] will not work because iloc expects indices
fruits_df.iloc[ [0,2], [2] ]

In [ ]:
fruits_df.iloc[ [0,2] ][ ["Country"] ]

In [ ]:
display ( fruits_df_indexed.loc[ ["Apple" ] ] )
display ( fruits_df_indexed.loc[ ["Apple" ] ].iloc[:,0:1] )

## Select Cells by Boolean Masking

In [ ]:
fruits_df

In [ ]:
# select fruits < $1 and from Russia
cond1 = fruits_df["Prices"] <1
cond2 = fruits_df["Country"] == "Russia"
fruits_df [ cond1 & cond2 ]

In [ ]:
# select fruits from Russia or Africa, price between 0.5 and 1

cond1= fruits_df["Country"] == "Russia"
cond2= fruits_df["Country"] == "Africa"

cond3= fruits_df["Prices"] >= 0.5
cond4= fruits_df["Prices"] <= 1

fruits_df [ (cond1 | cond2) & (cond3 & cond4)]

In [ ]:
cond1 = (fruits_df["Country"] == "Russia") | (fruits_df["Country"] == "Africa")
cond2 = (fruits_df["Prices"] >= 0.5) & (fruits_df["Prices"] <= 1)
fruits_df [ cond1 & cond2 ]

## First activity

In [13]:
import pandas as pd
car_model = pd.read_csv("car_model.csv")

In [ ]:
display(car_model)

In [ ]:
print(car_model)

In [ ]:
len(car_model) #rows

In [ ]:
len(car_model.columns) #columns

In [ ]:
car_model.columns

In [ ]:
car_model.shape

## Second Activity

In [14]:
# Select the column (variable) “Make” from the DataFrame.

car_model[ ["Make"] ]

           Make
0         Acura
1         Acura
2         Acura
3    Alfa Romeo
4    Alfa Romeo
..          ...
235       Volvo
236  Volkswagen
237       Volvo
238       Volvo
239       Volvo

[240 rows x 1 columns]

In [48]:
# Select all entries with the value “Audi” in the variable “Make” from the DataFrame.
cond1= car_model["Make"] == "Audi"
car_model[ ["Make"] & cond1]

    Year  Make       Model                 Category
5   2021  Audi  A6 allroad                    Wagon
6   2021  Audi          A7                    Sedan
7   2021  Audi          Q3                      SUV
8   2021  Audi          Q5                      SUV
9   2021  Audi          Q8                      SUV
10  2021  Audi          S5  Convertible,Sedan,Coupe
11  2021  Audi          S6                    Sedan

In [1]:
car_model[ car_model["Make"]  == "Audi"]

NameError: name 'car_model' is not defined

In [47]:
# Select the last 10 observations and only the variable “Year” from the DataFrame.
car_model.tail(10)["Year"]
car_model["Year"].tail(10)

230    2021
231    2021
232    2021
233    2021
234    2021
235    2021
236    2021
237    2021
238    2021
239    2021
Name: Year, dtype: int64

## Merge

In [ ]:
fruits_df

In [ ]:
pd.concat( [fruits_df, fruits_df] )

In [ ]:
test_df = pd.concat( [fruits_df, fruits_df] )
test_df

In [ ]:
test_df.loc[1] #returns index 1

In [ ]:
test_df.iloc[[1]] #returns position 1

In [ ]:
pd.concat( [fruits_df, fruits_df], ignore_index=True ) #new index

In [38]:
fruits_country_df = fruits_df[ ["Fruits", "Country"] ]
fruits_country_df

   Fruits      Country
0   Apple       Africa
1  Orange       Russia
2  Banana  New Zealand

In [39]:
fruits_prices_df = fruits_df[ ["Fruits", "Prices"] ]
fruits_prices_df

   Fruits  Prices
0   Apple     1.2
1  Orange     0.7
2  Banana     0.9

In [ ]:
pd.merge(fruits_country_df, fruits_prices_df , on="Fruits")

## Missing Data

In [4]:
fruits_missing_df = pd.read_csv("fruits_corrupted.csv")
fruits_missing_df

   Fruits  Prices      Country
0   Apple     NaN       Africa
1  Orange     0.7       Russia
2  Banana     0.9  New Zealand

In [5]:
#convert Russia into missing value
fruits_missing_df1 = pd.read_csv("fruits_corrupted.csv", na_values = "Russia", na_filter = True)
fruits_missing_df1

   Fruits  Prices      Country
0   Apple     NaN       Africa
1  Orange     0.7          NaN
2  Banana     0.9  New Zealand

In [6]:
fruits_missing_df.isnull()

   Fruits  Prices  Country
0   False    True    False
1   False   False    False
2   False   False    False

In [7]:
fruits_missing_df1.isnull().sum()

Fruits     0
Prices     1
Country    1
dtype: int64

In [8]:
fruits_missing_df1.isnull().sum(axis=0)

Fruits     0
Prices     1
Country    1
dtype: int64

In [9]:
fruits_missing_df1.isnull().sum(axis=1)

0    1
1    1
2    0
dtype: int64

In [10]:
fruits_missing_df1.isnull().any(axis=0)

Fruits     False
Prices      True
Country     True
dtype: bool

In [11]:
missing = fruits_missing_df1.isnull().any()
missing[ missing==True ].index

Index(['Prices', 'Country'], dtype='object')

## Delete Missing Data

In [ ]:
fruits_drop = fruits_missing_df.dropna(axis = 0, how = "any")
fruits_drop

## Replace Missing Data

In [ ]:
# replace Country Nan with Ukraine
# replace prices Nan with $100
fruits_missing_df1["Country"] = fruits_missing_df1["Country"].fillna(value = "Ukraine")
fruits_missing_df1["Prices"] = fruits_missing_df1["Prices"].fillna(value = 100)
fruits_missing_df1

In [ ]:
fruits_missing_df1["Country"].fillna(value = "Ukraine", inplace=True) 
# inplacebool, default False, If True, fill in-place
fruits_missing_df1["Prices"].fillna(value = 100, inplace=True)

## Outliers

In [40]:
fruits_outlier_df = pd.read_csv("fruits_outlier.csv")
fruits_outlier_df

   Fruits  Prices      Country
0   Apple     1.2       Africa
1  Orange     0.7       Russia
2  Banana     0.9  New Zealand
3  Durian  1000.0      Iceland

In [41]:
q1 = fruits_outlier_df["Prices"].quantile(q = 0.25)
q3 = fruits_outlier_df["Prices"].quantile(q = 0.75)

iqr = q3 - q1
print(q1)
print(q3)

print(iqr)

0.85
250.89999999999998
250.04999999999998

In [42]:
cond1 = fruits_outlier_df["Prices"] < (q1 - 1.5*iqr)
cond2 = fruits_outlier_df["Prices"] > (q3 + 1.5*iqr)

fruits_outlier_df[ cond1 | cond2 ]

   Fruits  Prices  Country
3  Durian  1000.0  Iceland

## Third Activity

In [56]:
# Remove all the rows with missing data in “price” from the ‘car_price_model.csv’

car_df = pd.read_csv("car_price_model.csv")
car_df.isnull().sum()

Year     0
Make     0
Model    0
Price    2
dtype: int64

In [54]:
display(car_df)

car_df_drop= car_df.dropna(axis = 0, how = "any")
display(car_df_drop)

     Year        Make    Model    Price
0    2021       Acura      ILX      NaN
1    2021       Acura      RDX      NaN
2    2021       Acura      TLX  37500.0
3    2021  Alfa Romeo   Giulia  40350.0
4    2021  Alfa Romeo  Stelvio  42350.0
..    ...         ...      ...      ...
235  2021       Volvo      V60  40950.0
236  2021  Volkswagen   Tiguan  25245.0
237  2021       Volvo     XC40  33700.0
238  2021       Volvo     XC60  41700.0
239  2021       Volvo     XC90  49000.0

[240 rows x 4 columns]

     Year        Make       Model    Price
2    2021       Acura         TLX  37500.0
3    2021  Alfa Romeo      Giulia  40350.0
4    2021  Alfa Romeo     Stelvio  42350.0
5    2021        Audi  A6 allroad  65900.0
6    2021        Audi          A7  69200.0
..    ...         ...         ...      ...
235  2021       Volvo         V60  40950.0
236  2021  Volkswagen      Tiguan  25245.0
237  2021       Volvo        XC40  33700.0
238  2021       Volvo        XC60  41700.0
239  2021       Volvo        XC90  49000.0

[238 rows x 4 columns]

In [57]:
car_df_drop.isnull().sum()

Year     0
Make     0
Model    0
Price    0
dtype: int64

In [ ]:
# Detect car models that can be considered as outliers in terms of their selling price
import matplotlib.pyplot as plt
plt.boxplot(car_df_drop)
plt.show()

In [ ]:
q1 = car_df_drop["Price"].quantile(q = 0.25)
q3 = car_df_drop["Price"].quantile(q = 0.75)

iqr = q3 - q1
print(q1)
print(q3)

print(iqr)

In [58]:
cond1 = car_df_drop["Price"] < (q1 - 1.5*iqr)
cond2 = car_df_drop["Price"] > (q3 + 1.5*iqr)

car_outlier_df = car_df_drop[ cond1 | cond2 ]
car_outlier_df["Model"]

11                             S6
16                             X7
23                       Escalade
24                   Escalade ESV
41     Silverado 3500 HD Crew Cab
130                   Range Rover
136                            LC
137                            LS
138                            LX
146                     Navigator
147                   Navigator L
159                       G-Class
164          Mercedes-AMG G-Class
181                    718 Spyder
182                           911
184                        Taycan
185                      Panamera
186                 Cayenne Coupe
192                           R1S
194                           R1T
202                       Model X
215                  Land Cruiser
Name: Model, dtype: object

In [ ]:
car_df["SGD price"]=car_df["Price"*1.5]
display(car_df)